---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldEditPropertiesService
source: html/295bf9cd-0424-035e-4d44-94f90ee628cd.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldEditPropertiesService Property

Autodesk Internal: The service for editing properties of a custom field.

## Syntax (C#)
```csharp
public static ExternalServiceId CustomFieldEditPropertiesService { get; }
```